app/controllers/emails_controller.rb

SELECT "emails".* FROM "emails" WHERE "emails"."id" = 33 LIMIT 1
---
  def edit
    @email = Email.find(params[:id])