app/controllers/posts_controller.rb

  def index
    # @posts = Post.all(:order => "created_at DESC")
    @posts = Post.paginate :page => params[:page], :per_page => 24, :order => "created_at DESC"
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "posts"

  def search
    @search = Post.search(params[:search])
    @posts = @search.all
    @posts = @search.paginate :page => params[:page], :per_page => 24, :order => "created_at DESC"
---
SELECT "posts".* FROM "posts" WHERE (posts.company LIKE '%Fresh%')
SELECT "posts".* FROM "posts" WHERE (posts.company LIKE '%keywordsBSM%') ORDER BY created_at DESC LIMIT 24 OFFSET 0
SELECT COUNT(*) FROM "posts"

  def list
    @posts = Post.paginate :page => params[:page], :per_page => 24, :order => "created_at DESC"
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC LIMIT 24 OFFSET 0
SELECT COUNT(*) FROM "posts"

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 35 LIMIT 1
UPDATE "posts" SET "description" = 'Every 2 minutes someone passes with BSM*\r\n\r\nBSM is the UK’s number one driving school, with over 3000 instructors helping some 170,000 budding motorists to pass their test every year.\r\n\r\nWhile BSM is best known for teaching learner drivers, it also provides advanced driving training to individuals and businesses and is one of the largest providers of training for driving instructors. BSM also plays an active role in lobbying the Government on road safety and learner driver-related issues.\r\n\r\nAt BSM, pupils have always benefited from quality tuition from our instructors, who we train to the highest professional standards. Today, our learners also benefit from taking their lessons in one of our fleet of Fiat 500’s (Car of the Year 2008).\r\n\r\n15 Epsom Road\r\nGuildford, Surrey GU1 3JT\r\n01483 560 429

  def feed
    @posts = Post.all(:select => "id, offer, description, company, imgurl, created_at", :order => "created_at DESC", :limit => 24)
---
SELECT id, offer, description, company, imgurl, created_at FROM "posts" ORDER BY created_at DESC LIMIT 20