app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "password_salt" = 'dJSTTstVshvDIllfC0cv', "crypted_password" = '39deeae89358edf5d2c303ee117c08d3474376d30ee83fa178ca7ad3dd6ce60bdc1e4d32d647798f8701ec3769b56e31e04c458a86b9828457b96106ab932fba', "persistence_token" = '6f209060a076949279c586eeb2fafe6eacf771fd84ccd5d1cec0ee68201103dfa11a06be62c1a022caccc32eacd12150d06b466a05eb119b655603fce62c3b1d', "last_request_at" = '2011-04-18 21:37:34.203000', "login_count" = 5, "last_login_at" = '2011-04-18 21:37:16.953000', "current_login_at" = '2011-04-18 21:37:34.203000', "updated_at" = '2011-04-18 21:37:34.203000' WHERE "users"."id" = 2