app/views/emails/_formmini.html.erb

<%= form_for Email.new do |f| %>
  <% if Email.new.errors.any? %>
---
SELECT "emails".* FROM "emails"